app/Controllers/User/RS/Permintaandarah.php

SELECT *
FROM `permintaan_darah`
WHERE `status` IN ('Baru','Proses')
---
    public function index()
    {
        $status = $this->request->getGet('status') ?? 'aktif';
        $model = new PermintaanDarahModel();

        if ($status == 'aktif') {
            $model->whereIn('status', ['Baru', 'Proses']);
        } elseif ($status == 'selesai') {
            $model->where('status', 'Selesai');
        } elseif ($status == 'draft') {
            $model->where('status', 'Draft');
        }

        $data['permintaan_darah_all'] = $model->findAll();