app/Controllers/Admin/KelolaAdmin.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
---
    public function kelola_user()
    {
        $keyword = $this->request->getVar('keyword');
        $role    = $this->request->getVar('role');

        if ($keyword) {
            $this->userModel->groupStart()
                            ->like('nama', $keyword)
                            ->orLike('email', $keyword)
                            ->groupEnd();
        }

        if ($role && $role !== '') {
            $this->userModel->where('role', $role);
        }

        $data = [
            'users'     => $this->userModel->paginate(5, 'users'),
            'pager'     => $this->userModel->pager,
            'totalData' => $this->userModel->pager->getTotal('users')
        ];