app/Controllers/DashboardPMI.php

    public function data_pendonor()
    {
        $donorModel = new DonorModel();

        $data['donor'] = $donorModel->findAll();
---
SELECT *
FROM `donor`
WHERE `donor`.`deleted_at` IS NULL