app/Controllers/DashboardAdmin.php

    public function admin()
    {
        $data['totalUser']       = $this->userModel->countAllResults();
        $data['totalDonor']      = $this->donorModel->countAllResults();

        // Nonaktifkan sementara jika model Permintaan belum siap
        // $data['totalPermintaan'] = $this->permintaanModel->countAllResults();
        $data['totalPermintaan'] = 0;

        // Mengambil Total dan 5 Aktivitas Terbaru dari tabel log_aktivitas
        $data['totalAktivitas']   = $this->logModel->countAllResults();
        $data['aktivitasTerbaru'] = $this->logModel->select('log_aktivitas.*, users.nama as nama_pengguna')
            ->join('users', 'users.id = log_aktivitas.id_user', 'left')
            ->orderBy('log_aktivitas.created_at', 'DESC')
            ->findAll(5);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `donor`
WHERE `donor`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `log_aktivitas`
WHERE `log_aktivitas`.`deleted_at` IS NULL
SELECT `log_aktivitas`.*, `users`.`nama` as `nama_pengguna`
FROM `log_aktivitas`
LEFT JOIN `users` ON `users`.`id` = `log_aktivitas`.`id_user`
WHERE `log_aktivitas`.`deleted_at` IS NULL
ORDER BY `log_aktivitas`.`created_at` DESC
 LIMIT 5

    public function data_donor()
     {
        $donorModel = new DonorModel();
        $data['donor'] = $donorModel->findAll();
---
SELECT *
FROM `donor`
WHERE `donor`.`deleted_at` IS NULL

    public function riwayat()
    {
        $keyword = $this->request->getVar('keyword');

        $this->logModel->select('log_aktivitas.*, users.nama as nama_pengguna')
                 ->join('users', 'users.id = log_aktivitas.id_user', 'left')
                 ->orderBy('log_aktivitas.created_at', 'DESC');

        if ($keyword) {
            $this->logModel->groupStart()
                     ->like('log_aktivitas.aktivitas', $keyword)
                     ->orLike('users.nama', $keyword)
                     ->groupEnd();
        }

        $data = [
            'logs'      => $this->logModel->paginate(5, 'logs'),
            'pager'     => $this->logModel->pager,
            'totalData' => $this->logModel->pager->getTotal('logs')
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `log_aktivitas`
LEFT JOIN `users` ON `users`.`id` = `log_aktivitas`.`id_user`
WHERE `log_aktivitas`.`deleted_at` IS NULL
SELECT `log_aktivitas`.*, `users`.`nama` as `nama_pengguna`
FROM `log_aktivitas`
LEFT JOIN `users` ON `users`.`id` = `log_aktivitas`.`id_user`
WHERE `log_aktivitas`.`deleted_at` IS NULL
ORDER BY `log_aktivitas`.`created_at` DESC
 LIMIT 5

    public function kelola_user()
    {
        $keyword = $this->request->getVar('keyword');
        $role    = $this->request->getVar('role');

        if ($keyword) {
            $this->userModel->groupStart()
                            ->like('nama', $keyword)
                            ->orLike('email', $keyword)
                            ->groupEnd();
        }

        if ($role && $role !== '') {
            $this->userModel->where('role', $role);
        }

        $data = [
            'users'     => $this->userModel->paginate(5, 'users'),
            'pager'     => $this->userModel->pager,
            'totalData' => $this->userModel->pager->getTotal('users')
        ];
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL