app/Controllers/DashboardRS.php

SELECT *
FROM `permintaan_darah`
WHERE `status` IN ('Baru','Proses')
---
    public function permintaan_darah()
    {
        $status = $this->request->getGet('status') ?? 'aktif';

        // 1. Inisialisasi Model yang sudah di-import di atas
        $model = new PermintaanDarahModel();

        // 2. Kondisikan query menggunakan Model berdasarkan tab yang diklik
        if ($status == 'aktif') {
            // Menampilkan yang statusnya 'Baru' atau 'Proses'
            $model->whereIn('status', ['Baru', 'Proses']);
        } elseif ($status == 'selesai') {
            // Menampilkan yang statusnya 'Selesai'
            $model->where('status', 'Selesai');
        } elseif ($status == 'draft') {
            // Menampilkan yang statusnya 'Draft'
            $model->where('status', 'Draft');
        }
        // Jika status 'semua', tidak di-filter (menampilkan semua data)

        // 3. Ambil data hasil filter dari database
        $data['permintaan_darah_all'] = $model->findAll();