app/Controllers/Register.php

    public function proses()
    {
        // Cek apakah password dan konfirmasi password sama
        if (
            $this->request->getPost('password_reg') !=
            $this->request->getPost('konfirmasi_password')
        ) {
            return redirect()->back()->with(
                'error',
                'Konfirmasi password tidak cocok'
            );
        }

        $model = new usermodels();

        $model->insert([
            'email'    => $this->request->getPost('email_reg'),
            'role'     => $this->request->getPost('role_reg'),
            'password' => password_hash(
                $this->request->getPost('password_reg'),
                PASSWORD_DEFAULT
            )
        ]);
---
INSERT INTO `users` (`nama`, `email`, `role`, `password`, `created_at`, `updated_at`) VALUES ('rs madANI', 'zbluevampir08@gmail.com', 'pmi', '$2y$10$O9pg2jpsfqm9Tlhx1.8dmu/bpmUsh5vAnc0HI900A3VHTU9Qch0xy', '2026-06-08 07:13:19', '2026-06-08 07:13:19')