app/Controllers/User/PMI/DashboardPMI.php

    public function pmi()
    {
        $donorModel = new DonorModel();
        $permintaanModel = new PermintaanDarahModel();
        $logModel = new LogAktivitasModel();

        $data['totalDonor'] = $donorModel->countAllResults();
        // Memanggil file: app/Views/Tampilan_PMI/dashboard_PMI.php

        $data['donorAktif'] = $donorModel
            ->where('status', 'aktif')
            ->countAllResults();

        $data['permintaanMasuk'] = $permintaanModel->countAllResults();

        $data['aktivitas'] = $logModel
            ->orderBy('id', 'DESC')
            ->findAll(5);
---
SELECT COUNT(*) AS `numrows`
FROM `donor`
WHERE `donor`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `donor`
WHERE `status` = 'aktif'
AND `donor`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `permintaan_darah`
SELECT *
FROM `log_aktivitas`
WHERE `log_aktivitas`.`deleted_at` IS NULL
ORDER BY `id` DESC
 LIMIT 5